ERP DEV.WMS/src/Catalogs/вмс_Контейнеры/вмс_Контейнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Контейнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТипТары</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыКонтейнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.вмс_ВидыПартийТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПартии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Вскрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/InformationRegisters/ШтрихкодыКонтрагентов/ШтрихкодыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыКонтрагентов</name>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Использовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Catalogs/вмс_Контейнеры/ManagerModule.bsl
// Создает заданное Количество контейнеров определенного типа
//
// Параметры:
//  ДанныеЗаполнения - Структура	 - данные для заполнения (см. "НовыеПараметрыСозданияКонтейнеров")
// 
// Возвращаемое значение:
//   - Массив - созданные контейнеры
//
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//ТУ_Августинович ++ 24.04.2026
// - Приведение различных механизмов генерации контейнеров к единому целому


Функция СоздатьКонтейнеры_Старая(ДанныеЗаполнения) Экспорт
	
	МассивКонтейнеров = Новый Массив;
	
	Для сч = 1 По ДанныеЗаполнения.Количество Цикл
		
		НовоеНаименование = Справочники.вмс_Контейнеры.ПолучитьНовыйНомерТары(ДанныеЗаполнения.ТипКонтейнера);
		
		НовыйКонтейнер = Справочники.вмс_Контейнеры.СоздатьЭлемент();
		НовыйКонтейнер.Заполнить(Неопределено);
		ЗаполнитьЗначенияСвойств(НовыйКонтейнер, ДанныеЗаполнения);
		
		НовыйКонтейнер.ТипТары = ДанныеЗаполнения.ТипКонтейнера;
		НовыйКонтейнер.Наименование = НовоеНаименование;
		НовыйКонтейнер.Штрихкод = НовоеНаименование;
		НовыйКонтейнер.ОснованиеСтрокой = Строка(ДанныеЗаполнения.Распоряжение);
		НовыйКонтейнер.Записать();
		
		МассивКонтейнеров.Добавить(НовыйКонтейнер.Ссылка);
		
	КонецЦикла;
	
	Возврат МассивКонтейнеров;
	
КонецФункции

// Создает заданное Количество контейнеров определенного типа
//
// Параметры:
//  ДанныеЗаполнения - Структура - Данные для заполнения (см. "НовыеПараметрыСозданияКонтейнеров")
// 
// Возвращаемое значение:
//   - Массив - созданные контейнеры
//
Функция СоздатьКонтейнеры(ДанныеЗаполнения) Экспорт
	
	КоличествоКонтейнеров = ДанныеЗаполнения.Количество;
	ТипКонтейнера		  = ДанныеЗаполнения.ТипКонтейнера;
	ДокументОснование	  = ДанныеЗаполнения.Распоряжение;
	
	РезультатМетода = Справочники.вмс_Контейнеры.ПолучитьМассивУникальныхИдентификаторов(КоличествоКонтейнеров);
	МассивКонтейнеров = Новый Массив;
	Префикс = СтрЗаменить(ТипКонтейнера.Префикс,"_","");
	ДатаГенерации = Формат(ДанныеЗаполнения.ДатаПартии, "ДФ=ddMMyymmss");
	Счетчик = 1;
	ПервыйСимвол = Лев(Строка(ТипКонтейнера), 1) + "_";
	
	Если РезультатМетода.Результат = Истина Тогда
		Для Каждого УИСтрока ИЗ РезультатМетода.Данные Цикл
			
			НовыйКонтейнер = Справочники.вмс_Контейнеры.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(НовыйКонтейнер, ДанныеЗаполнения);
			
			НовыйКонтейнер.УстановитьСсылкуНового(Справочники.вмс_Контейнеры.ПолучитьСсылку(УИСтрока.УникальныйИдентификатор));
			НовыйКонтейнер.ТипТары = ТипКонтейнера;
			НовыйКонтейнер.Штрихкод = ?(УИСтрока.Наименование = ""
										, Префикс + УИСтрока.УникальныйИдентификатор
										, УИСтрока.Наименование);
			НовыйКонтейнер.Наименование = ?(УИСтрока.Наименование = ""
											, ПервыйСимвол + ДатаГенерации + "_" + Строка(Счетчик) + " (" + ТипКонтейнера + ")"
											, УИСтрока.Наименование);
			
			НовыйКонтейнер.Записать();     
			
			МассивКонтейнеров.Добавить(НовыйКонтейнер.Ссылка);
			Счетчик = Счетчик + 1;
		КонецЦикла;
	Иначе
		Ошибка = РезультатМетода.Данные;
	КонецЕсли;
	
	Возврат МассивКонтейнеров;
КонецФункции //СоздатьКонтейнеры_Новая

//ТУ_Августинович -- 24.04.2026

Функция НовыеПараметрыСозданияКонтейнеров() Экспорт
	
	ПараметрыСоздания = Новый Структура();
	ПараметрыСоздания.Вставить("Количество", 1);
	ПараметрыСоздания.Вставить("ТипКонтейнера", Неопределено);
	ПараметрыСоздания.Вставить("Контрагент", Неопределено);
	ПараметрыСоздания.Вставить("Распоряжение", Неопределено);
	ПараметрыСоздания.Вставить("ДатаПартии", ТекущаяДатаСеанса());
	
	Возврат ПараметрыСоздания;
	
КонецФункции



Функция ПолучитьНовыйНомерТары(типТары) Экспорт
	
	ДлинаНаименования 		   = Метаданные.Справочники.вмс_Контейнеры.ДлинаНаименования;
	Префикс          		   = типТары.Префикс;
	ДлинаПрефикса     		   = СтрДлина(Префикс);
	ДлинаНаНомер      		   = ДлинаНаименования - ДлинаПрефикса;
	НезанятыйНомер   		   = ПолучитьКоличествоТарыВБазе() + 1;
	ДлинаЛидирующихНулей       = ДлинаНаНомер - СтрДлина(Строка(НезанятыйНомер)); 
	
	ВедущиеНули = Формат(0,"ЧЦ=" + ДлинаЛидирующихНулей + ";ЧН=; ЧВН=; ЧГ=0");
	
	// Кулалаев Е.С + 09.03.2022 15:37:10
	// -----Описание-----
	// Убрал ведущие нули 
	// ------------------ 
	//НовыйНомер = "" + Префикс + ВедущиеНули + НезанятыйНомер; 
	НовыйНомер = "" + Префикс + НезанятыйНомер;
	// Кулалаев Е.С -   
	
	НовыйНомер = СтрЗаменить(НовыйНомер, Символы.НПП, "");
	
	Возврат НовыйНомер;
	
КонецФункции  

Функция ПолучитьМассивУникальныхИдентификаторов(КоличествоДанных = 1,ИспользоватьЭтикеткиКонтрагента = Ложь, Контрагент = Неопределено) Экспорт  
	
	ТаблицаСсылок = Новый ТаблицаЗначений;
	ТаблицаСсылок.Колонки.Добавить("УникальныйИдентификатор");
	ТаблицаСсылок.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка"));
	
	МассивИспользованныхЗаписей = Новый Массив;
	
	Если ИспользоватьЭтикеткиКонтрагента Тогда 
		
		НаборЗаписей = РегистрыСведений.ШтрихкодыКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Заполнить(Неопределено);
		НаборЗаписей.Отбор.Контрагент.Установить(Контрагент); 
		НаборЗаписей.Отбор.Использовано.Установить(Ложь);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда  
			Возврат Новый Структура("Результат,Данные",Ложь,"Нет подходящих штрихкодов для использования");		
		КонецЕсли;
		
		Если НаборЗаписей.Количество() < КоличествоДанных  Тогда   
			Разница = КоличествоДанных - НаборЗаписей.Количество(); 
			Возврат Новый Структура("Результат,Данные",Ложь,"Не хватает " + Разница + " этикеток для печати");	
		КонецЕсли;
		
	КонецЕсли;

	// Пробежим по записям
	Для Счетчик = 1 По КоличествоДанных Цикл 
		нСтр = ТаблицаСсылок.Добавить();
		нСтр.УникальныйИдентификатор = ПолучитьСсылку().УникальныйИдентификатор(); 
		Если ИспользоватьЭтикеткиКонтрагента Тогда 
			Запись = НаборЗаписей.Получить(ТаблицаСсылок.Индекс(нСтр));
			МассивИспользованныхЗаписей.Добавить(Запись);
			нСтр.Наименование = Запись.Штрихкод;
		КонецЕсли;
	КонецЦикла;
	// Пробежим по записям

	// Пометим что использовали
	Если ИспользоватьЭтикеткиКонтрагента Тогда	
		
		Для каждого Запись Из МассивИспользованныхЗаписей Цикл 
			
			МенеджерЗаписи = РегистрыСведений.ШтрихкодыКонтрагентов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Запись); 
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Использовано = Истина; 
				МенеджерЗаписи.Записать(Истина);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// Пометим что использовали
	
	Возврат Новый Структура("Результат,Данные",Истина,ТаблицаСсылок);
		
КонецФункции

Функция ПолучитьКоличествоТарыВБазе() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕстьNULL(СУММА(1),0) КАК КоличествоЭлементов
	|ИЗ
	|	Справочник.вмс_Контейнеры КАК вмс_Контейнеры";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоЭлементов
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуРазузлованнойТары(ТараДляРазузлования) Экспорт

	ДеревоТары = Новый ДеревоЗначений;
	ДеревоТары.Колонки.Добавить("Контейнер");
	ДеревоТары.Колонки.Добавить("МастерТара"); 
	
	Продолжаем = Истина;
	
	Пока Продолжаем Цикл  
		РазузловатьТару(ДеревоТары,ТараДляРазузлования);
		Продолжаем = Ложь;
	КонецЦикла; 
	
	Возврат ДеревоТары;
	
КонецФункции

Функция РазузловатьТару(КоллекцияТары,ТараДляРазузлования)
	
	ПодчиненныеЭлементы = Справочники.вмс_Контейнеры.Выбрать(ТараДляРазузлования);
	
	Пока ПодчиненныеЭлементы.Следующий() Цикл
		нСтр = КоллекцияТары.Строки.Добавить();	
		нСтр.МастерТара = ТараДляРазузлования;
		нСтр.Тара = ПодчиненныеЭлементы.Ссылка;
		РазузловатьТару(нСтр, ПодчиненныеЭлементы.Ссылка);
	КонецЦикла;
	
	
КонецФункции

Функция ЗаполнитьМассивТаройНижнегоУровня(КоллекцияСтрок,МассивЗначений) Экспорт
	
	Для каждого Строка Из КоллекцияСтрок Цикл
		
		Если Строка.Строки.Количество() = 0 Тогда
			МассивЗначений.Добавить(Строка.Тара);	
		Иначе  
			ЗаполнитьМассивТаройНижнегоУровня(Строка.Строки,МассивЗначений);
		КонецЕсли;
	
	КонецЦикла;


КонецФункции

// ТУ_Прошин_03.05.24++
Функция ПолучитьШтрихкодСозданногоКонтейнера(ДокументОснование, ГуидДокумента, ИмяТипаДокумента) Экспорт
	
	КоличествоКонтейнеров = 1;
	ТипКонтейнера = ПланыВидовХарактеристик.ТипыКонтейнеров.НайтиПоНаименованию("Паллета", Истина);
	
	МенеджерКонтейнеров = Справочники.вмс_Контейнеры;
	Префикс = СтрЗаменить(ТипКонтейнера.Префикс,"_","");
	п_МассивКонтейнеров = Новый Массив;
	ДатаГенерации = Формат(ТекущаяДата(), "ДФ=ddMMyymmssms"); 
	
	РезультатМетода = ПолучитьМассивУникальныхИдентификаторов(КоличествоКонтейнеров);
	Если РезультатМетода.Результат = Истина Тогда   
		
		Для Каждого УИСтрока Из РезультатМетода.Данные Цикл                     
			
			НовыйКонтейнер = Справочники.вмс_Контейнеры.СоздатьЭлемент();
			НовыйКонтейнер.Заполнить(Неопределено);
			НовыйКонтейнер.УстановитьСсылкуНового(Справочники.вмс_Контейнеры.ПолучитьСсылку(УИСтрока.УникальныйИдентификатор));
			НовыйКонтейнер.ТипТары = ТипКонтейнера;
			НовыйКонтейнер.Штрихкод = ?(УИСтрока.Наименование = "",Префикс + УИСтрока.УникальныйИдентификатор,УИСтрока.Наименование);
			НовыйКонтейнер.ИдентификаторОснования = ГуидДокумента;
			НовыйКонтейнер.ОснованиеСтрокой = ИмяТипаДокумента; 
			
			НовыйКонтейнер.Распоряжение = ДокументОснование;	
			
			НовыйКонтейнер.Наименование = ?(УИСтрока.Наименование = "", ДатаГенерации  + " (" + ТипКонтейнера + ")",УИСтрока.Наименование); 
			НовыйКонтейнер.Записать();     
			
			п_МассивКонтейнеров.Добавить(НовыйКонтейнер.Ссылка);
		КонецЦикла;
	Иначе
		Ошибка = РезультатМетода.Данные;	
	КонецЕсли;  
	
	Возврат п_МассивКонтейнеров[0].Штрихкод;
	
	
КонецФункции
// ТУ_Прошин_03.05.24--

Функция УстановитьФлагВскрытКонтейнеру(Контейнер) Экспорт 
	// ТУ_Прошин_24.11.25+
	ОбъектКонтейнера = Контейнер.ПолучитьОбъект();
	ОбъектКонтейнера.Вскрыт = Истина;
	ОбъектКонтейнера.Записать(); 
	// ТУ_Прошин_24.11.25-
КонецФункции

Функция ПолучитьСуперКонтейнер() Экспорт
	// ТУ_Кулалаев Е.С ++ 11.06.2024 11:48:53
	// Переброс контейнеров на защищенный модуль
	
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").ВыполнитьФункциюКонтейнеров("ПолучитьСуперКонтейнер", Новый Структура);
	
КонецФункции

Функция ПолучитьПустойКонтейнер() Экспорт
	// ТУ_Кулалаев Е.С ++ 11.06.2024 11:48:53
	// Переброс контейнеров на защищенный модуль
	
	Возврат вмс_ОбщегоНазначенияВызовСервера.Модуль("вмс_ЗащищенныйМодуль").ВыполнитьФункциюКонтейнеров("ПолучитьПустойКонтейнер", Новый Структура);
	
КонецФункции

#КонецЕсли
